// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

//let num = prompt("Ви маєте ввести значення від 1 до 4 включно");
//num = Number(num);
//switch (num) {
   // case 1: 
   //     console.log('зима');
   //     break;
    
  //  case 2: 
  //      console.log('весна');
   //     break;
    
   // case 3: 
  //      console.log('літо');
   //     break;
    
  //  case 4: 
  //      console.log('осінь');
  //      break;
    
   // default: 
   //     console.log("Вибачте, але ви маєте ввести значення від 1 до 4 включно");
    
//}
